In [21]:
import pandas as pd
import numpy as np

df = pd.read_csv("data.csv")

In [10]:
df

    name  age       state  num_children  num_pets
0   john   23        iowa             2         0
1   mary   78          dc             2         4
2  peter   22  california             0         0
3   jeff   19       texas             1         5
4   bill   45  washington             2         0
5   lisa   33          dc             1         0

In [11]:
df[df["age"] > 30]

   name  age       state  num_children  num_pets
1  mary   78          dc             2         4
4  bill   45  washington             2         0
5  lisa   33          dc             1         0

In [12]:
df[ df["num_pets"] > df[ "num_children"] ]

   name  age  state  num_children  num_pets
1  mary   78     dc             2         4
3  jeff   19  texas             1         5

In [13]:
df[ (df["age"] > 40) & (df["num_pets"] > 0) ]

   name  age state  num_children  num_pets
1  mary   78    dc             2         4

In [15]:
df2 = df.drop(["age","num_children"],1)
df2

    name       state  num_pets
0   john        iowa         0
1   mary          dc         4
2  peter  california         0
3   jeff       texas         5
4   bill  washington         0
5   lisa          dc         0

In [42]:
df[["age","num_pets","num_children"]].apply( lambda row: np.mean(row),axis=0)

age             36.666667
num_pets         1.500000
num_children     1.333333
dtype: float64

In [44]:
df[["age","num_pets","num_children"]].apply(lambda row: np.sum(row),axis=1)

0    25
1    84
2    22
3    25
4    47
5    34
dtype: int64